{
    "gksoftware": "GKSOFTWARE",
    "gksoftware-desc": "You can access the source codes of all my projects, or the project itself if it is live, through this site. Since I am an open source lover and a free software lover, almost all of my projects are open source. I would be happy if you clone my project, run it locally, and contribute or criticize it. You can also reach my social media accounts through this site to contact me.",
    "why-web-header": "Why Are Web Technologies Important?",
    "why-web": "Web technologies are the fundamental elements that enable communication, interaction, and information sharing in the digital world. Today, the internet plays a critical role in every field, from commerce to education, healthcare to entertainment, and web technologies shape this experience by providing businesses with global reach while offering quick solutions to users' needs. Additionally, with the rise of mobile devices and cloud-based services, they allow the creation of flexible and dynamic platforms that can be accessed from anywhere. The development of web technologies supports innovation, continuously improving user experiences.",
    "web-app-website-header": "Web App vs Website",
    "web-app-website": "Websites provide static information, while web applications offer interactive and dynamic experiences. Websites are usually content-focused, delivering information, whereas web applications perform functional tasks through continuous data exchange with the user. Web applications are more complex, requiring regular updates and maintenance, while websites are simpler and consume fewer resources.",
    "why-new-tech-header": "Why New Technologies?",
    "why-new-tech": "Using new technologies in the web field improves user experience, enhances speed and performance, and provides scalability. For example, SSR (Server-Side Rendering) allows faster page loading, and SPA (Single Page Application) offers a seamless user experience. Cloud-based solutions like SaaS (Software as a Service) and PaaS (Platform as a Service) accelerate software development and deployment processes.",
    "data-exc": "Data Exchange",
    "update": "Update",
    "performance": "Performance",
    "interaction": "Interaction",
    "ssr": "Server Side Rendering",
    "spa": "Single Page Application",
    "saas": "SaaS",
    "paas": "PaaS",
    "practical": "Practical",
    "fast": "Fast",
    "customizable": "Customizable",
    "new-tech": "New Technology",
    "informative": "Informative",
    "versatile": "Versatile",
    "ui-ux": "UI-UX",
    "safe": "Safe",
    "clone": "Clone this repostory",
    "copy-message": "Copied command!",
    "go-to-project": "Go to project",
    "home": "Home",
    "showcase": "Showcase",
    "projects": "Projects",
    "resume": "Resume",
    "title": "Title",
    "description": "Description",
    "go-back": "Go Back",
    "technologies": "Technologies",
    "see-this-project": "See this project",
    "follow-yourself": "Follow Yourself",
    "get-country": "Get Country",
    "chat-app": "Chat App",
    "blog-app": "Blog App",
    "merchantile-app": "Merchantile App",
    "crypto-app": "Crypto Tracker",
    "academy": "Personal Academician Site",
    "food-app": "Food App",
    "follow-yourself-short-desc": "A web application that allows you to track your activities.",
    "get-country-short-desc": "A web application that contains a lot of information about all countries in the world.",
    "chat-app-short-desc": "A basic chat application.",
    "blog-app-short-desc": "A simple blog application.",
    "food-app-short-desc": "A basic cafeteria application.",
    "merchantile-app-short-desc": "Full stack trading web app.",
    "academy-short-desc": "It is a full stack web application for academician.",
    "crypto-app-short-desc": "A web application where every user can add and track any cryptocurrency they want to their watchlist.",
    "follow-yourself-desc": "It is a web application that you can follow your activities with algorithms instead of traditional methods such as Excel. It is a personal agenda that you can follow many of your activities such as the movies you watch, the games you play, the books you read or your investments and access on your local computer. When you reach certain levels, it contains algorithms that make suggestions suitable for your interests and inform you about the path you have covered. It is open source and free.",
    "get-country-desc": "It is an open source and free web application where you can access a lot of information about more than 250 countries. You can access a lot of information such as where the traffic flows in which country, neighboring countries or military flags.",
    "chat-app-desc": "In the chat application, I used backend technologies such as firebase. This application is not a full chat application. I will do it soon using technologies such as nodeJs. In this application, I used firebase technologies such as instant data update. Again, I used time-related javascript technologies such as momentJs.",
    "blog-app-desc": "In this application, I wanted to use some backend technologies again. I used axios api for features such as adding and bringing blogs. I used basic api technologies such as sending data to api and pulling data. Again, I completed the backend operations with firebase. As in most of my projects, I completed the status management with pinia.",
    "food-app-desc": "Here, I developed a cafeteria application using some back-end technologies. I also took care to use javascript technologies such as momentJs. I also added many user interactions such as categorization, dark/light mode.",
    "merchantile-app-desc": "It is a trading application developed with front-end and back-end. Auto logout. Add/delete/update product. You can save your products, favorite them or mark them as sold and display them on your relevant pages. At the same time, the total of your sold products and your total earnings will be displayed on your sold page. View products from relevant categories. View the products you have uploaded to the platform together on your 'My Products' page.",
    "academy-desc": "It is a full stack web application where an academic can share, add, delete and update many of his/her activities such as his/her studies, blog posts, CV. He/she can do these only by logging into the admin panel interface. It is made upon request.",
    "crypto-app-desc": "You can create a user record and add cryptocurrencies to your own watchlist. The aim here is to develop a web application using back-end technologies such as firebase. I used many technologies such as authorization and personal panel in this project. I did not see the need to get the live prices of cryptocurrencies via API. Because I thought it would be negative in terms of cost and would be detracting from the main purpose of the project.",
    "see-now": "See Now",
    "insurance": "Insurance and Risk Management",
    "finance": "Finance",
    "computer-programming": "Computer Programming",
    "baskent": "Baskent University",
    "atilim": "Atilim University",
    "anadolu": "Anadalu University",
    "bachelor": "Bachelor's Degree",
    "master": "Master's Degree",
    "freelance": "Freelance",
    "vektorel": "Web Designer and Web Programmer at Vektorel Bilisim (Approved by Microsoft, AutoDesk and Adobe)",
    "education": "Education",
    "certificates": "Certificates",
    "skills": "Skills",
    "experiences": "Experiences",
    "what-next": "What Next?"
}