{
    "gksoftware": "GKSOFTWARE",
    "gksoftware-desc": "Bütün uygulamalarım",
    "why-web-header": "Web Teknolojileri Neden Önemli?",
    "why-web": "Web teknolojileri, dijital dünyada iletişimi, etkileşimi ve bilgi paylaşımını mümkün kılan temel unsurlardır. Günümüzde internet, ticaretten eğitime, sağlıktan eğlenceye kadar her alanda kritik bir rol oynamaktadır ve bu deneyimi şekillendiren web teknolojileri, işletmelere küresel erişim sağlarken kullanıcıların ihtiyaçlarına hızlı çözümler sunar. Ayrıca, mobil cihazlar ve bulut tabanlı hizmetlerin yaygınlaşmasıyla birlikte, her yerden erişilebilen esnek ve dinamik platformlar oluşturulmasına imkan tanır. Web teknolojilerinin gelişimi, inovasyonu destekleyerek kullanıcı deneyimlerini sürekli olarak iyileştirmektedir.",
    "web-app-website-header": "Web Uygulamaları vs Web Siteleri",
    "web-app-website": "Web siteleri statik bilgi sunarken, web uygulamaları etkileşimli ve dinamik deneyimler sunar. Web siteleri genellikle içerik odaklı olup bilgi verir, web uygulamaları ise kullanıcıyla sürekli veri alışverişi yaparak fonksiyonel işlemler gerçekleştirir. Web uygulamaları daha karmaşık olup sürekli güncelleme ve bakım gerektirirken, web siteleri daha basit ve az kaynak kullanır.",
    "why-new-tech-header": "Neden Yeni Teknolojiler?",
    "why-new-tech": "Web alanındaki yeni teknolojileri kullanmak, kullanıcı deneyimini iyileştirir, hız ve performans kazandırır, ayrıca ölçeklenebilirlik sağlar. Örneğin, SSR (Server-Side Rendering) ile sayfalar daha hızlı yüklenir, SPA (Single Page Application) ile kesintisiz bir kullanıcı deneyimi sunulur. SaaS (Software as a Service) ve PaaS (Platform as a Service) gibi bulut tabanlı çözümler ise yazılım geliştirme ve dağıtımı süreçlerini hızlandırır.",
    "data-exc": "Veri Alışverişi",
    "update": "Güncelleme",
    "performance": "Performans",
    "interaction": "Etkileşim",
    "ssr": "Sunucu Taraflı İşleme",
    "spa": "Tek Sayfa Uygulama",
    "saas": "SaaS",
    "paas": "PaaS",
    "practical": "Kullanışlı",
    "fast": "Hızlı",
    "customizable": "Kişiselleştirilebilir",
    "new-tech": "Yeni Teknoloji",
    "informative": "Bilgilendirici",
    "versatile": "Çok Yönlü",
    "ui-ux": "UI-UX",
    "safe": "Güvenli",
    "clone": "Bu deponun klonunu oluştur",
    "copy-message": "Komut kopyalandı!",
    "go-to-project": "Projeye git",
    "home": "Anasayfa",
    "showcase": "Vitrin",
    "projects": "Projeler",
    "resume": "Özgeçmiş",
    "title": "Başlık",
    "description": "Açıklama",
    "go-back": "Geri Dön",
    "technologies": "Teknolojiler",
    "see-this-project": "Bu projeyi gör",
    "follow-yourself": "Follow Yourself",
    "get-country": "Get Country",
    "chat-app": "Chat Uygulaması",
    "blog-app": "Blog Uygulaması",
    "merchantile-app": "Ticaret Uygulaması",
    "crypto-app": "Kripto Takip Uygulaması",
    "academy": "Kişisel Akademisyen Sitesi",
    "food-app": "Yemekhane Uygulaması",
    "follow-yourself-short-desc": "Kendi aktivitelerinizi takip etmenizi sağlayan bir web uygulaması.",
    "get-country-short-desc": "Dünyadaki tüm ülkeler hakkında birçok bilgi içeren bir web uygulaması.",
    "chat-app-short-desc": "Basit bir sohbet uygulaması.",
    "blog-app-short-desc": "Basit bir blog uygulaması.",
    "food-app-short-desc": "Basit bir kafeterya uygulaması.",
    "merchantile-app-short-desc": "Tam kapsamlı bir ticaret web uygulaması.",
    "academy-short-desc": "Akademisyenler için tam kapsamlı bir web uygulaması.",
    "crypto-app-short-desc": "Her kullanıcının istediği kripto parayı izleme listesine ekleyip takip edebileceği bir web uygulaması.",
    "follow-yourself-desc": "Aktivitelerinizi takip etmenizi sağlayan bir web uygulaması.",
    "get-country-desc": "Dünyadaki tüm ülkeler hakkında birçok bilgi içeren bir web uygulaması.",
    "chat-app-desc": "Temel bir sohbet uygulaması.",
    "blog-app-desc": "Basit bir blog uygulaması.",
    "food-app-desc": "Temel bir kafeterya uygulaması.",
    "merchantile-app-desc": "Ön ve arka uç ile geliştirilen bir ticaret uygulaması. Otomatik çıkış. Ürün ekleme/silme/güncelleme. Ürünlerinizi kaydedebilir, favori olarak işaretleyebilir veya satıldı olarak işaretleyebilirsiniz ve ilgili sayfalarda gösterebilirsiniz. Aynı zamanda satılan ürünlerinizin toplamı ve toplam kazancınız, satılmış ürünler sayfanızda gösterilecektir. Ürünleri ilgili kategorilerden görüntüleyebilir ve platforma yüklediğiniz ürünleri 'Ürünlerim' sayfanızda birlikte görüntüleyebilirsiniz.",
    "academy-desc": "Bir akademisyenin çalışmaları, blog yazıları, CV gibi birçok etkinliğini paylaşabileceği, ekleyebileceği, silebileceği ve güncelleyebileceği bir tam yığın web uygulaması. Sadece yönetici paneli arayüzüne giriş yaparak bu işlemleri yapabilir. İsteğe bağlı olarak yapılmıştır.",
    "crypto-app-desc": "Her kullanıcının izleme listesine ekleyip takip edebileceği herhangi bir kripto para birimini ekleyip takip edebileceği bir web uygulaması.",
    "see-now": "Şimdi Gör",
    "insurance": "Sigortacılık ve Risk Yönetimi",
    "finance": "Finans",
    "computer-programming": "Bilgisayar Programcılığı",
    "baskent": "Başkent Üniversitesi",
    "atilim": "Atılım Üniversitesi",
    "anadolu": "Anadalu Üniversitesi",
    "bachelor": "Lisans",
    "master": "Yüksek Lisans",
    "freelance": "Freelance",
    "vektorel": "Web Programcılığı ve Tasarımcılığı, Vektorel Bilişim (Microsoft, AutoDesk ve Adobe onaylıdır.)",
    "education": "Eğitim",
    "certificates": "Sertifikalar",
    "skills": "Yetenekler",
    "experiences": "Deneyimler",
    "what-next": "Sıradaki Ne ?"
}